//数组
//写法一
let arr1 = new Array("小明","小红","小可爱")   
console.log(arr1)
//写法二
let arr2 = ["小蓝","小黄","小宝贝"]
console.log(arr2)
//注意!!  用new Array的话是()不是[],简便的用法才直接用[]
//-----------------------------------------------------------------------------------------
//输出数组的第?个
let arr3 = ["小蓝","小黄","小宝贝","小粉","小红","小绿"]
console.log(arr3[0])  //输出数组的第一个
console.log(arr3[1])   //输出数组的第二个
//注意,数组第一个是[0]不是[1]

console.log(arr3[arr3.length - 1]) //arr3.lenth 最大的数  
                                   //再-1是不是最后一个了所以arr3[最大的数-1] = arr3[最后一个]
                                